# EffectInstance Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EffectInstance Properties
EffectInstance Class See Also
---
The EffectInstance type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace